def zd7():
    import random
    math = [random.randint(1,101) for i in range(15)]
    rus = [random.randint(1,101) for i in range(15)]
    inf  = [random.randint(1,101) for i in range(15)]
    name =["Смирнов Алексей Дмитриевич",
    "Иванова Елена Сергеевна",
    "Кузнецов Дмитрий Анатольевич",
    "Попова Анастасия Павловна",
    "Васильев Павел Владимирович",
    "Петрова Ольга Николаевна",
    "Соколов Максим Александрович",
    "Михайлова Татьяна Ивановна",
    "Новиков Андрей Викторович",
    "Федорова Екатерина Георгиевна",
    "Морозов Сергей Юрьевич",
    "Волкова Наталья Викторовna",
    "Алексеев Дмитрий Игоревич",
    "Лебедева Мария Константиновна",
    "Семенов Александр Олегович"]
    res = []
    for i in range(15):
        total = math[i] + rus[i] + inf[i]
        res.append([total, i])
    res.sort(reverse=True)
    for i in range(10):
        index = res[i][1]
        print(index,":",name[index])

zd7()